package com.dycn.shairportcommon.constant;

/**
 * @author Liq
 * @date 2020/12/29
 */
public interface Constant {

    String MESSAGE = "接口调用成功";

    String EMPTY_STR = "";

    String AUDITSTRING = "审核中";



    String PREFIX = "HEALTH_REPORT:";
    String REDIS_JWT_KEY_PREFIX = PREFIX + "SECURITY:JWT";


    String ADMIN = "admin";

    /**
     * 启用
     */
    Integer ENABLE = 1;
    /**
     * 禁用
     */
    Integer DISABLE = 0;



    public interface RedisCon {

        String PREFIX = "HEALTH_REPORT:";
        String YITU_TOKEN = PREFIX + "YITU_TOKEN";
        String YITU_USER = PREFIX + "YITU_USER";


        String APP_VERSION = PREFIX + "APP_VERSION";
    }


    public interface Jky{

        // 查询用户健康状态
        String HEALTH_STATUS = "konggang-account-get-health-status";
        // 用户文档
        String TEMPERATURE = "konggang-account-get-temperature";


        String NAD_EXAMINE_REPORT = "konggang-account-get-nad-examine-report";

        String NAD_EXAMINE_REPORT_LIST = "konggang-nad-examine-report-list";


        // 核酸检测报告结果提交
        String TEST_REPORT = "konggang-nad-examine-report-audit";

        String VACCINATE_REPORT = "konggang-ncov-vaccinate-credential-audit";

        String ACCOUNT_REGISTER = "konggang-account-register";
        String ACCOUNT_REMOVE = "konggang-account-cancel";


        String TEST = "test-post";

        String FACE_PHOTO = "konggang-account-get-face-photo";


        String HEALTH_RULE = "konggang-account-set-health-rule";

        String ORG_EXAMINE_REPORT = "konggang-organization-upload-nad-examine-report";


        String ORG_VACCINATE_REPORT = "konggang-organization-upload-ncov-vaccinate-credential";


    }

    public interface Yitu {
        String USERNAME = "dy01";
        String PASSWORD = "123456";

        String YITU_IP = "http://10.138.35.34:8088/v1/deyun/";

        String  FACE_EXTRACT = "?a=feature_extract";

        String LOGIN = "?a=login";

        String INDEX_ADD = "?a=index_add";



        String INDEX_DEL = "?a=index_del";

        String INDEX_DETAIL = "?a=index_detail";

        String FACE_VN = "?a=feature_1vn";

        String FACE_ADD = "?a=feature_add";

        String FACE_DEL = "?a=feature_del";


        String FACE_LIB = "airport_worker_faces";

        String VISITOR_LIB = "airport_visitor";


        String VISITOR_LIB1 = "airport_visitor1";





    }






    /**
     * 浦东所有单位集合(不包含子部门)
     */
    String[] pvg = {"上海国际机场股份有限公司", "上海机场建设指挥部", "机场华美达", "东庄海岸",
            "锦江之星浦东机场店", "浦虹检测", "上海大众空港宾馆", "浦东要客贵宾部", "一大队", "二大队", "五大队", "自贸区",
            "公安托管", "浦东机场海关", "上海机场边检站", "中航油", "巴士三公司", "波音公司", "上海外航服务公司", "南方航空",
            "金鹏航空", "厦门航空", "山东航空", "海南航空", "成都航空", "深圳航空", "西藏航空"};

    /**
     * 浦东下 上海国际机场股份有限公司 子部门
     */
    String[] pvg_1 = {"机关（股份）","飞行区管理部（股份）","航站区管理部（股份）","场区管理部（股份）","安检护卫保障部","交通保障部（股份）","机电信息保障部（股份）","能源保障部（股份）","消防急救保障部（股份）","商业公司（股份）","餐饮公司（股份）","上海机场广告有限公司（股份）","地服公司（浦东）","航油公司（股份）","东航（浦东）","安检护卫保障部（股份）","海南航空控股股份有限公司","四川航空","上海市国际机场保安服务有限公司（浦东）","厦门航空（浦东）","服务管理部","中国邮政航空公司","上海波音航空改装维修工程有限公司","顺丰航空有限公司上海航站","人事科","财务科","办公室（航站区）","TOC","采购管理科","服务管理科","技术设备科","环境标识科","旅客服务科","安全管理科","党群办公室","计划经营科","现场运行科","同创共建办公室","施工管理科","物业管理科（航站区）","智慧机场项目组","特勤科","站点管理科","交通运行控制中心（TIC）","出租车蓄车场管理科","职工食堂管理科","停车管理一科","停车管理二科","停车管理三科","交保机关","系统研发科（股份机电）","系统运行中心（股份机电）","业务支持科（股份机电）","数据中心（股份机电）","安防管理科（股份机电）","系统工程科（股份机电）","行李系统管理科（股份机电）","机电维修科（股份机电）","客桥运行科（股份机电）","捷运管理科（股份机电）","机关科室（股份机电）","供电保障科","热能保障科","水务保障科","计量管理科","候机楼保障一科","候机楼保障二科","场区维修科","卫星厅保障科","运行管理中心","能源技术设备科","合作经营（楚阳）","经营权转让（旅惠）","委外（维保单位）","经营权转让（云味馆）","经营权转让（西贝）","地服委外","地服部（浦东）","东航食品（浦东）","技术公司（浦东）","实业公司（浦东）","综管部（浦东）","东航进出口（浦东）","信息部（浦东）","客户委（浦东）","组织部（浦东）","运控中心（浦东）","飞行部（浦东）","东航传媒（浦东）","空保部（浦东）","群团部（浦东）","客舱部（浦东）","工程部（浦东）","纪检办（浦东）","上航国旅（浦东）","pdaj机关部室","pdaj运管科","pdaj设备维修科","pdaj旅检一科","pdaj旅检二科","pdaj旅检三科","pdaj旅检四科","pdaj旅检五科","pdaj旅检六科","pdaj行检一科","pdaj行检二科","pdaj门禁一科","pdaj门禁二科","pdaj门禁三科","pdaj候机楼一科","pdaj候机楼二科","pdaj货检一科","pdaj货检二科","pdaj出入口安全检查一科","pdaj出入口安全检查二科","pdaj监护科","pdaj特勤科","pdaj机坪科","pdaj其他外部人员","pdajD区贵宾转运一组","pdajD区贵宾转运二组","pdaj货运督查一组","pdaj货运督查二组","物业管理科维修模块委外","物业管理科用房模块委外","物业管理科保洁模块委外","上海航纵计算机科技有限公司（系统研发科委外）","用友网络科技股份有限公司上海分公司（系统研发科委外）","北京慧点科技有限公司（系统研发科委外）","梅杰科技（苏州）有限公司","上海奎灏信息技术有限公司","烟台持久钟表集团有限公司","上海诚森计算机科技信息有限公司","上海兰库机电设备有限公司","上海隆信科技有限公司","上海邦涉电子系统有限公司","上海凯毅科技发展有限公司","盛视科技股份有限公司","上海恬飞科技有限公司","上海众铭技防科技有限公司","北京泰豪智能工程有限公司","中航机场系统设施建设有限公司","上海电科智能系统股份有限公司","上海至诚环境服务有限公司","上海天玑科技股份有限公司","上海民航华东凯亚系统集成有限公司","思唐信息科技（北京）有限公司","上海浦敏科技发展股份有限公司","上海宝通汎球电子有限公司","上海合胜计算机科技有限公司","智略信息技术（上海）有限公司","上海德鋆信息科技有限公司","上海自动化仪表有限公司","上海市安装工程集团有限公司","安赛泊（北京）机场软件系统科技有限公司","上海理想信息产业（集团）有限公司","华存数据","仪电物联","北明软件有限公司","北京赛迪时代信息产业股份有限公司","如东信息技术服务（上海）有限公司","上海华讯网络系统有限公司","南京泰睿麒信息技术有限公司","上海恒驰信息系统有限公司","奎灏","泰科","兆翔","民航二所","技贸","迅宇（系统工程科厂商）","电信工程（系统工程科厂商）","云思智慧（系统工程科厂商）","上海移动（系统工程科厂商）","上海联通（系统工程科厂商）","上海电信（系统工程科厂商）","铁塔公司（系统工程科厂商）","虹浦公司（系统工程科厂商）","伯曼机械制造（上海)有限公司","德利九州物流自动化（北京）有限公司","上海东方航空设备制造有限公司","范德兰德物流自动化系统（上海）有限公司","上海至诚","溧阳申菱电梯工程有限公司","上海世瑞实业公司","南京踏实信息科技有限公司","华东凯亚（机电行李）","北方机电","上海浦敏科技发展股份有限公司（机电行李）","同方威视技术股份有限公司","上海强丽","上海迅宇智能科技（机电行李）","浙江中天智汇安装工程有限公司","上海华城工程建设管理有限公司","上海谷乾","奥的斯电梯（股份机电）","三菱电梯（股份机电）","通力电梯（股份机电）","东芝电梯（股份机电）","中集天达（股份机电）","山东威海（股份机电）","广东申菱（股份机电）","江苏塞孚（股份机电）","上海乔佑（股份机电）","深圳市耀诚机电设备有限公司（机电客桥）","上海至诚环境服务有限公司（机电客桥）","上海方能航空服务有限公司（机电客桥）","上海方能电力工程设备有限公司（机电客桥）","上海申凯公共交通运营管理有限公司","中车长春轨道客车股份有限公司","上海富欣智能交通控制有限公司","上海市基础工程集团有限公司","上海至诚保洁服务有限公司（办公室委外）","地服部浦东旅客服务中心","地服部浦东装卸服务中心","地服部浦东站坪服务中心","地服部载重平衡中心（浦东）","地服部行李服务中心（浦东）","地服部外航服务中心（浦东）","地服部地面运行控制中心(浦东）","地服部外委单位（浦东）","地服部人力资源部（浦东）","地服部综合事务部（浦东）","地服部后勤保障部（浦东）","地服部安全监察部（浦东）","东航食品（浦东外包）","东航美心（浦东）","技术公司上海东方飞机维修有限公司","技术公司东航虹飞实业责任有限公司","技术公司上海中特建设工程技术有限公司","技术公司上海启港航空设备有限公司","技术公司浦东消防班","技术公司上海科技宇航有限公司","技术公司上海沪特航空技术有限公司","技术公司浦东维修基地","上海东方航空物业有限公司","南京南航天辰民航设备器材有限公司","飞机维修部设备保障中心（供应商）","东实设备浦东","设备公司浦东","设备服务浦东","酒店管理浦东","物业公司浦东","综管部房产部浦东","综管部航卫部浦东","综管部后勤部浦东","综管部机组部浦东","综管部职服浦东","综管部汽运部浦东","综管部运行部浦东","上海东航报关实业有限公司(浦东）","东航进出口（浦东）航空事业部","东航进出口（浦东）第三方","销服部-浦东","运维部-浦东","人力外包-浦东","办公室-浦东","客户委外包单位1","客户委外包单位2","运控浦东上指","运控浦东航务","运控浦东应急","运控浦东导航","运控浦东情报","pdaj保障部领导","pdaj办公室","pdaj党委办公室","pdaj工会办公室","pdaj财务科","pdaj计划经营科","pdaj人事科","pdaj安全质控科","pdaj培训科","pdaj技术设备科","pdaj驾驶班","pdaj门卫","pdaj四期建设办公室","pdaj设备维修科委外厂商","pdaj技术设备科项目厂商","卫星厅质保","浦东旅客服务中心","东航美心（浦东外包）","浦东外航维修","浦东波音航线","浦东空客航线","酒店管理上航酒店","酒店管理浦东机组公寓","物业公司浦东外包","酒店管理上航酒店外包","物业公司外包万杰"};

    /**
     * 浦东下 上海外航服务公司 子部门
     */
    String[] pvg_2 = {"上海外航服务公司人力资源分公司","上海太古飞机工程服务有限公司","地面代理分公司","比利时ASL航空公司","美国博立航空公司","马来西亚亚洲航空(长途)有限公司","美国航空公司","俄罗斯航空公司","大韩航空公司","伊朗马汉航空航空公司上海代表处","美国阿特拉斯航空","加拿大航空公司","全日空航空公司","菲律宾宿务太平洋航空","阿塞拜疆丝绸之路西部航空","法国航空","印度航空公司","芬兰航空公司","英国航空公司","长荣航空","台湾中华航空","卢森堡货运航空公司上海办事处","国泰航空公司","美国达美航空","阿联酋航空公司","埃塞俄比亚航空集团","阿联酋阿提哈德航空","印度尼西亚鹰航空公司","香港航空有限公司","日本航空公司","荷兰皇家航空公司","日本货物航空","德国汉莎航空公司","德国汉莎货运航空公司","韩国真航空上海代表处","马来西亚国际航空有限公司上海办事处","澳门航空公司","新西兰航空公司","美国国家航空公司","韩亚航空公司","菲律宾航空公司","澳大利亚澳洲航空公司上海代表处","卡塔尔航空公司","俄罗斯空桥货运航空公司上海代表处","斯堪的纳维亚航空公司","新加坡航空公司","俄罗斯西伯利亚航空公司","泰国狮子蒙特里航空公司","沙特阿拉伯航空公司","泰国国际航空公司","土耳其航空公司","美国联合航空公司","斯里兰卡航空公司","越南航空公司","维珍航空公司上海办事处","乌兹别克斯坦航空公司上海代表处","朝鲜高丽航空公司上海代表处","香港货运航空","克林维尔","瑞士国际航空公司","文莱皇家航空公司","亚环北京航空信息咨询有限公司","以色列航空公司","北京华龙商务航空有限公司","丽翔航空（上海）有限公司"};

    /**
     * 浦东下 南航(浦东) 子部门
     */
    String[] pvg_3 = {"南航(浦东)", "南航（浦东货运）", "南航（浦东运指）", "南航（浦东机务）",
            "南航（浦东地服）", "南航（浦东后保）", "南航（浦东明珠）"};

    /**
     * 虹桥所有单位集合(不包含子部门)
     */
    String[] hq = {"上海虹桥国际机场公司", "虹桥综合工程部", "上海霍克太平洋公务航空地面服务有限公司",
            "实业机关", "虹桥要客贵宾部", "机关（职能部室）", "市场经营部", "技术工程部",
            "支队领导", "法制业务科", "组织人事科", "办公室", "三大队", "六大队", "集团公司机关", "民航华东管理局",
            "空港巴士", "国航", "春秋航空", "吉祥航空"};

    /**
     * 虹桥下 上海虹桥国际机场公司 子部门
     */
    String[] hq_1 = {"机关（虹桥）","飞行区管理部（虹桥）","场区管理部（虹桥）","安检护卫保障部（虹桥）","机电信息保障部（虹桥）","能源保障部（虹桥）","消防急救保障部（虹桥）","建设管理部（虹桥）","交通管理部（虹桥）","沪港公司（虹桥）","地服公司（虹桥）","东航（虹桥）","保安服务有限公司（虹桥）","场容管理科","物业管理科","机电信息保障部（委外）","上海捷康环保科技有限公司","上海捷康环保科技有限公司","TMC","公共交通管理科","停车管理科","沪港员工（内部）","运行管理部（委外）","商业经营部（商户）","技术工程部（委外）","安全服务部（委外）","上海国际机场地面服务有限公司","地服部（虹桥）","东航食品（虹桥）","技术公司（虹桥）","综管部（虹桥）","东航进出口（虹桥）","信息部（虹桥）","实业公司（虹桥）","飞行部（虹桥）","客舱部（虹桥）","空保部（虹桥）","一二三航（虹桥）","上航（虹桥）","集团办公室","董事办","组织部","战略发展部","集团财务部","深改办","人力部","安监部","法律部","审计部","保卫部","党宣部","巡视办","纪检办","群团部","离退办","商务委","销售委","总值班室","股份办公室","规划部","财会部","运管部","飞管部","工程部","虹桥指挥部","政策研究室","东航传媒","东航产投","运控中心（虹桥）","东航物流（虹桥）","客户委（虹桥）","上航国旅（虹桥）","地服部虹桥旅客服务中心","地服部虹桥装卸服务中心","地服部虹桥站坪服务中心","地服部载重平衡中心（虹桥）","地服部地面运行控制中心（虹桥）","地服部外航服务中心（虹桥)","地服部行李服务中心（虹桥）","地服部外委单位（虹桥）","地服部综合事务部（虹桥）","地服部人力资源部（虹桥）","地服部业务执行部","地服部业务发展部","地服部航站管理部","地服部群团工作部","地服部党委工作部","地服部纪委办公室","地服部培训管理部","地服部安全监察部（虹桥）","地服部保卫部","地服部后勤保障部（虹桥）","东航美心（虹桥）","东航食品（虹桥外包）","技术公司罗罗驻场办公司","技术公司虹桥消防班","技术公司空客驻场办公室","技术公司波音驻场办公室","技术公司虹桥维修基地","技术公司虹飞","综管部综合事务部","综管部党群工作部","综管部基建管理部","综管部房产管理部","综管部地面安全监察部","综管部航空卫生管理部","综管部后勤服务部","综管部机组服务部","综管部职工服务中心","综管部汽车运输部","综管部运行值班部","综管部采购管理部","综管部工会俱乐部","综管部油料管理部","综管部物资设备部","上海东航报关实业有限公司","上海东航国际贸易有限公司","上海东航招标咨询有限公司","东航进出口（虹桥）航空事业部","东航进出口（虹桥）采购事业部","东航进出口（虹桥）第三方","党群部","纪委办公室","质控部","销服部","网站部","运行部","管控部","治理部","洞察部","机务部","物流部","移动部","前沿部","安全部","网络部","主机部","运维部","人力外包","办公室-虹桥","部领导","人力部-虹桥","规划部-虹桥","设备服务虹桥","物业公司虹桥","东航实业机关","酒店管理虹桥","上航办公室","上航人力部","上航规划部","上航党工部","上航群团部","上航纪委办","上航安监部","上航运管部","上航服质部","上航总值班","上航机务部","上航运控部","上航飞管部","上航飞行部","上航客舱部","上航空保部（保卫部）","上航公司领导","上海合杰人才服务有限公司","销售委销售中心组","销售委销售管理组","销售委销售支持组","销售委上海营业部","销售委综合事务部","销售委人力资源部","销售委党委群团工作部","销售委纪委办公室","销售委领导","运控综合","运控飞签","运控上指","运控东指","运控安质","运控业务","运控调配","运控航务","运控情报","运控导航","运控国动","运控应急","运控重大","运控人力","运控党群","东航物流（货站事业部）-虹桥","东航物流（虹桥机关）","东航物流（物流解决方案事业部）-虹桥","东航物流（物流仓储事业部）-虹桥","东航物流（东航运输）-虹桥","东航物流（东航快递）-虹桥","东航物流（供应链公司）-虹桥","东航物流（东方福达）-虹桥","东航物流（市场营销部）-虹桥","东航物流（运输服务管理部）-虹桥","东航物流（中货航）-虹桥","第三方外包（虹桥）","东航物流（第三方外包）虹桥机关","东航物流（第三方外包）虹桥供应链","东航物流（第三方外包）虹桥货站事业部","东航物流（第三方外包）虹桥快递公司","客户委（电商公司）","东航美心（虹桥外包）","生产支援部","空客航线维修部","基地领导","波音航线维修部","生产控制中心","外航勤务中心","安全质量培训部","定检维修部","附件维修部","国产飞机部","综合事务部","综管航卫公卫","综管航卫地面","综管航卫空勤","综管虹桥车队","综管业务车队","物业公司虹桥外包","酒店管理虹桥外包","酒店管理虹桥天合汽运","酒店管理虹桥东航大酒店","酒店管理虹桥机场宾馆","特种车辆","工装中心","航材中心","LCC","综合车队","修理车间","空客航线维修部一车间","空客航线维修部二车间","空客航线维修部三车间","空客航线维修部四车间","波音航线维修部一车间","波音航线维修部二车间","波音航线维修部三车间","波音航线维修部四车间","外航勤务中心一组","外航勤务中心二组","空客定检维修车间","波音定检维修车间","电子客舱维修车间","结构修理车间","定检维修控制中心","航椅维修车间","机电维修车间","电子维修车间","计量检测中心","生产技术分部","商飞"};

    /**
     * 虹桥下 上海霍克太平洋公务航空地面服务有限公司 子部门
     */
    String[] hq_2 = {"华龙航空上海公司", "上海浦江物业有限公司", "艾比会展", "达索猎鹰商务服务(北京)有限公司上海分公司",
            "天成商务航空有限公司", "亚联公务机有限公司", "上海航新航宇机械技术有限公司"};

    /**
     * 虹桥下 虹桥要客贵宾部 子部门
     */
    String[] hq_3 = {"上海机场贵宾服务有限公司虹桥要客贵宾部"};

    /**
     * 虹桥下 市场经营部 子部门
     */
    String[] hq_4 = {"日上免税行（上海）有限公司", "上海金萌实业有限公司", "上海苏浙汇投资管理咨询有限公司"};

    /**
     * 虹桥下 民航华东管理局 子部门
     */
    String[] hq_5 = {"局领导、办公室","战略部","财务部","安管部","空管部","通导部","气象部","基建部","党办","纪委","工会","团委","离退部","资产办","虹塔","流量室","运管中心","飞服中心","飞计中心","监控中心","技保中心","维修中心","网络公司","气象中心","培训中心","指挥部","后服中心","建设公司","华港酒店","虹普公司","人劳部","虹浦公司","空管中心综合办","空管中心安管室","空管中心区管中心","空管中心领导"};

    /**
     * 虹桥下 国航 子部门
     */
    String[] hq_6 = {"计划财务部","人力资源部","航空安全管理部","飞行技术管理部","运行质量管理部","党群工作部","国航上海分公司纪委办公室","国航上海分公司保卫部","飞行部","生产指挥中心","高端旅客服务部","客舱服务部","综合保障部","空保大队","华东基地","华东营销","华东分控","上海信息分部","中航泊悦","建开物业","航食","民航快递","国航服","Ameco","Ameco01","Ameco02","Ameco03","Ameco04","Ameco05","Ameco06","Ameco07","Ameco08","Ameco09","Ameco10","Ameco11","Ameco12"};

    /**
     * 虹桥下 南航(虹桥) 子部门
     */
    String[] hq_7 = {"南航(虹桥)", "南航（虹桥货运）", "南航（虹桥运指）", "南航（虹桥机务）",
            "南航（虹桥后保）", "南航（虹桥明珠）"};

    /**
     * 货运单位集合
     */
    String[] freight = {"货运事业部","虹桥货运区","PACTL","快通","浦虹","快件","西区","一仓","事业部","东航（货运）",
            "东航物流（浦东）","地服部（浦东）","领速物流","顺城物流","致全","罗森便利店","云舟物流","汇桥物流","薛航物流",
            "木董物流","奇宾","厦航货运处","春秋货运处","春秋","捷利","佳成","上海威盛报关有限公司","中外运速递有限公司","OCS",
            "北京明邦","上海义达国际物流有限公司","顺丰","顺城","DHL","FedEx","UPS","顺同航空地面服务有限公司","西区公共区域",
            "邮政","安昕国际","上海世双国际货物运输代理有限公司","久进","承平国际物流","上海东方惠能国际货物运输代理有限公司",
            "上海创兴","先达国际货运","传奇国际货物运输代理有限公司","美时国际","邦达天原","天津泰达","上海广鸿国际","嘉华",
            "裕辉物流","上海通运","上海傲星","青旅","德威空运","华加","硕达","东浩兰生","亚东","益豪锦","日通","长发","近铁",
            "上海商神国际物流有限公司","大众","经贸国际","上海中远海运航空货运代理有限公司","敦豪","展濠","汉宏物流","德祥",
            "港中旅华贸","中外运跨境电商物流有限公司","上海国际航空服务有限公司","一仓其他","东航物流（货站事业部）-浦东",
            "东航物流（物流解决方案事业部）-浦东","东航物流（物流仓储事业部）-浦东","东航物流（东航运输）-浦东",
            "东航物流（东航快递）-浦东","东航物流（供应链公司）-浦东","东航物流（市场营销部）-浦东","东航物流（运输服务管理部）-浦东",
            "东航物流（中货航）-浦东","东航物流（机关）-浦东","东航物流（第三方外包）货站事业部","东航物流（第三方外包）机关",
            "东航物流（第三方外包）供应链","东航物流（第三方外包）物流仓储事业部","东航物流（第三方外包）运输公司",
            "东航物流（第三方外包）物流解决方案事业部","东航物流（第三方外包）快递公司"};

    /**
     * 东航
     */
    String[] dh = {"东航集团","东航（货运）","东航物流（浦东）","东航（浦东）","东航（虹桥）"};
    /**
     * 东航物流（浦东
     */
    String[] dh_1 = {"东航物流（货站事业部）-浦东","东航物流（物流解决方案事业部）-浦东","东航物流（物流仓储事业部）-浦东",
            "东航物流（东航运输）-浦东","东航物流（东航快递）-浦东","东航物流（供应链公司）-浦东","东航物流（市场营销部）-浦东",
            "东航物流（运输服务管理部）-浦东","东航物流（中货航）-浦东","东航物流（机关）-浦东","东航物流（东方福达）-浦东",
            "第三方外包（浦东）","东航物流（第三方外包）货站事业部","机关（外包）-浦东","东航物流（第三方外包）机关",
            "东航物流（第三方外包）供应链","东航物流（第三方外包）物流仓储事业部","东航物流（第三方外包）运输公司",
            "东航物流（第三方外包）物流解决方案事业部","东航物流（第三方外包）快递公司"};
    /**
     * 东航（虹桥）
     */
    String[] dh_2 = {"地服部（虹桥）","东航食品（虹桥）","技术公司（虹桥）","综管部（虹桥）","东航进出口（虹桥）","信息部（虹桥）","实业公司（虹桥）","飞行部（虹桥）","客舱部（虹桥）","空保部（虹桥）","一二三航（虹桥）","上航（虹桥）","集团办公室","董事办","组织部","战略发展部","集团财务部","深改办","人力部","安监部","法律部","审计部","保卫部","党宣部","巡视办","纪检办","群团部","离退办","商务委","销售委","总值班室","股份办公室","规划部","财会部","运管部","飞管部","工程部","虹桥指挥部","政策研究室","东航传媒","东航产投","运控中心（虹桥）","东航物流（虹桥）","客户委（虹桥）","上航国旅（虹桥）","地服部虹桥旅客服务中心","地服部虹桥装卸服务中心","地服部虹桥站坪服务中心","地服部载重平衡中心（虹桥）","地服部地面运行控制中心（虹桥）","地服部外航服务中心（虹桥)","地服部行李服务中心（虹桥）","地服部外委单位（虹桥）","地服部综合事务部（虹桥）","地服部人力资源部（虹桥）","地服部业务执行部","地服部业务发展部","地服部航站管理部","地服部群团工作部","地服部党委工作部","地服部纪委办公室","地服部培训管理部","地服部安全监察部（虹桥）","地服部保卫部","地服部后勤保障部（虹桥）","东航美心（虹桥）","东航食品（虹桥外包）","技术公司罗罗驻场办公司","技术公司虹桥消防班","技术公司空客驻场办公室","技术公司波音驻场办公室","技术公司虹桥维修基地","技术公司虹飞","综管部综合事务部","综管部党群工作部","综管部基建管理部","综管部房产管理部","综管部地面安全监察部","综管部航空卫生管理部","综管部后勤服务部","综管部机组服务部","综管部职工服务中心","综管部汽车运输部","综管部运行值班部","综管部采购管理部","综管部工会俱乐部","综管部油料管理部","综管部物资设备部","上海东航报关实业有限公司","上海东航国际贸易有限公司","上海东航招标咨询有限公司","东航进出口（虹桥）航空事业部","东航进出口（虹桥）采购事业部","东航进出口（虹桥）第三方","党群部","纪委办公室","质控部","销服部","网站部","运行部","管控部","治理部","洞察部","机务部","物流部","移动部","前沿部","安全部","网络部","主机部","运维部","人力外包","办公室-虹桥","部领导","人力部-虹桥","规划部-虹桥","设备服务虹桥","物业公司虹桥","东航实业机关","酒店管理虹桥","上航办公室","上航人力部","上航规划部","上航党工部","上航群团部","上航纪委办","上航安监部","上航运管部","上航服质部","上航总值班","上航机务部","上航运控部","上航飞管部","上航飞行部","上航客舱部","上航空保部（保卫部）","上航公司领导","上海合杰人才服务有限公司","销售委销售中心组","销售委销售管理组","销售委销售支持组","销售委上海营业部","销售委综合事务部","销售委人力资源部","销售委党委群团工作部","销售委纪委办公室","销售委领导","运控综合","运控飞签","运控上指","运控东指","运控安质","运控业务","运控调配","运控航务","运控情报","运控导航","运控国动","运控应急","运控重大","运控人力","运控党群","东航物流（货站事业部）-虹桥","东航物流（虹桥机关）","东航物流（物流解决方案事业部）-虹桥","东航物流（物流仓储事业部）-虹桥","东航物流（东航运输）-虹桥","东航物流（东航快递）-虹桥","东航物流（供应链公司）-虹桥","东航物流（东方福达）-虹桥","东航物流（市场营销部）-虹桥","东航物流（运输服务管理部）-虹桥","东航物流（中货航）-虹桥","第三方外包（虹桥）","东航物流（第三方外包）虹桥机关","东航物流（第三方外包）虹桥供应链","东航物流（第三方外包）虹桥货站事业部","东航物流（第三方外包）虹桥快递公司","客户委（电商公司）","东航美心（虹桥外包）","生产支援部","空客航线维修部","基地领导","波音航线维修部","生产控制中心","外航勤务中心","安全质量培训部","定检维修部","附件维修部","国产飞机部","综合事务部","综管航卫公卫","综管航卫地面","综管航卫空勤","综管虹桥车队","综管业务车队","物业公司虹桥外包","酒店管理虹桥外包","酒店管理虹桥天合汽运","酒店管理虹桥东航大酒店","酒店管理虹桥机场宾馆","特种车辆","工装中心","航材中心","LCC","综合车队","修理车间","空客航线维修部一车间","空客航线维修部二车间","空客航线维修部三车间","空客航线维修部四车间","波音航线维修部一车间","波音航线维修部二车间","波音航线维修部三车间","波音航线维修部四车间","外航勤务中心一组","外航勤务中心二组","空客定检维修车间","波音定检维修车间","电子客舱维修车间","结构修理车间","定检维修控制中心","航椅维修车间","机电维修车间","电子维修车间","计量检测中心","生产技术分部","商飞"};
    /**
     * 东航（浦东）
     */
    String[] dh_3 = {"地服部（浦东）","东航食品（浦东）","技术公司（浦东）","实业公司（浦东）","综管部（浦东）","东航进出口（浦东）","信息部（浦东）","客户委（浦东）","组织部（浦东）","运控中心（浦东）","飞行部（浦东）","东航传媒（浦东）","空保部（浦东）","群团部（浦东）","客舱部（浦东）","工程部（浦东）","纪检办（浦东）","上航国旅（浦东）","地服部浦东旅客服务中心","地服部浦东装卸服务中心","地服部浦东站坪服务中心","地服部载重平衡中心（浦东）","地服部行李服务中心（浦东）","地服部外航服务中心（浦东）","地服部地面运行控制中心(浦东）","地服部外委单位（浦东）","地服部人力资源部（浦东）","地服部综合事务部（浦东）","地服部后勤保障部（浦东）","地服部安全监察部（浦东）","东航食品（浦东外包）","东航美心（浦东）","技术公司上海东方飞机维修有限公司","技术公司东航虹飞实业责任有限公司","技术公司上海中特建设工程技术有限公司","技术公司上海启港航空设备有限公司","技术公司浦东消防班","技术公司上海科技宇航有限公司","技术公司上海沪特航空技术有限公司","技术公司浦东维修基地","上海东方航空物业有限公司","南京南航天辰民航设备器材有限公司","飞机维修部设备保障中心（供应商）","东实设备浦东","设备公司浦东","设备服务浦东","酒店管理浦东","物业公司浦东","综管部房产部浦东","综管部航卫部浦东","综管部后勤部浦东","综管部机组部浦东","综管部职服浦东","综管部汽运部浦东","综管部运行部浦东","上海东航报关实业有限公司(浦东）","东航进出口（浦东）航空事业部","东航进出口（浦东）第三方","销服部-浦东","运维部-浦东","人力外包-浦东","办公室-浦东","客户委外包单位1","客户委外包单位2","运控浦东上指","运控浦东航务","运控浦东应急","运控浦东导航","运控浦东情报","浦东旅客服务中心","东航美心（浦东外包）","浦东外航维修","浦东波音航线","浦东空客航线","酒店管理上航酒店","酒店管理浦东机组公寓","物业公司浦东外包","酒店管理上航酒店外包","物业公司外包万杰"};
}
